Hi @davedomainx, thank you for reporting this issue. The reason for this is that FortiAPI needs extra double quotes to analyze the value of the server. When this happens, just update the configuration field with value returned from _terraform plan_, the problem will be resolved. Can you please change 
`server = "8.8.8.8"`
to 
`server  = "\"8.8.8.8\"" `
in your configuration? 

**Validation**:
```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token = "rGqsgj9Qmh3dwfQdc8hd3t3G6xG3N5" # 6.2.0
  insecure = "true"
}

resource "fortios_system_virtualwanlink" "trname" {
    load_balance_mode = "source-ip-based"
    status            = "enable"

    health_check {
        name    = "Google"
        server  = "\"8.8.8.8\""
    }
}


# terraform apply
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_virtualwanlink.trname will be created
  + resource "fortios_system_virtualwanlink" "trname" {
      + fail_detect       = (known after apply)
      + id                = (known after apply)
      + load_balance_mode = "source-ip-based"
      + status            = "enable"

      + health_check {
          + addr_mode                    = (known after apply)
          + failtime                     = (known after apply)
          + http_agent                   = (known after apply)
          + http_get                     = (known after apply)
          + http_match                   = (known after apply)
          + interval                     = (known after apply)
          + name                         = "Google"
          + packet_size                  = (known after apply)
          + port                         = (known after apply)
          + probe_packets                = (known after apply)
          + protocol                     = (known after apply)
          + recoverytime                 = (known after apply)
          + security_mode                = (known after apply)
          + server                       = "\"8.8.8.8\""
          + sla_fail_log_period          = (known after apply)
          + sla_pass_log_period          = (known after apply)
          + threshold_alert_jitter       = (known after apply)
          + threshold_alert_latency      = (known after apply)
          + threshold_alert_packetloss   = (known after apply)
          + threshold_warning_jitter     = (known after apply)
          + threshold_warning_latency    = (known after apply)
          + threshold_warning_packetloss = (known after apply)
          + update_cascade_interface     = (known after apply)
          + update_static_route          = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_virtualwanlink.trname: Creating...
fortios_system_virtualwanlink.trname: Creation complete after 0s [id=SystemVirtualWanLink]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_system_virtualwanlink.trname: Refreshing state... [id=SystemVirtualWanLink]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```
If you require any further information, let me know. Thank you!

